lib/braspag/templates/crypto/encrypt.xml.erb

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header />
  <env:Body>
    <tns:EncryptRequest xmlns:tns="https://www.pagador.com.br/webservice/BraspagGeneralService">
      <tns:merchantId><%= connection.merchant_id %></tns:merchantId>
      <tns:request>
        <% map.each do |key, value| %>
          <tns:string><%= key %>=<%= value %></tns:string>
        <% end %>
      </tns:request>
    </tns:EncryptRequest>
  </env:Body>
</env:Envelope>